Repository: Apps-FinLog/FinLog
Catalog: lib/l10n/app_*.arb
Languages: id

# profileScreenTitle
source: Profile
id: Profil

# languageSettingsTitle
source: Language Settings
id: Pengaturan Bahasa

# languageSettingsSubtitle
source: Change application language
id: Ubah bahasa aplikasi

# languageSettingsSubtitleId
source: Currently: Bahasa Indonesia
id: Saat ini: Bahasa Indonesia

# languageSettingsSubtitleEn
source: Currently: English
id: Saat ini: English

# indonesianLanguage
source: Indonesian
id: Bahasa Indonesia

source: Select Language
id: Pilih Bahasa

source: Save Changes
id: Simpan Perubahan

source: Cancel
id: Batal

# logoutConfirmation
source: Confirm Logout
id: Konfirmasi Keluar

# logoutConfirmationMessage
source: Are you sure you want to log out of the application?
id: Apakah Anda yakin ingin keluar dari aplikasi?

source: Logout
id: Keluar

source: Personal Information
id: Informasi Personal

# memberSince
source: Member since {year}
id: Member sejak {year}

source: Gemini API Settings
id: Pengaturan API Gemini

source: Configure AI here
id: Konfigurasi AI di sini

source: Notification Settings
id: Pengaturan Notifikasi

source: Manage app notifications
id: Kelola notifikasi aplikasi

source: Help
id: Bantuan

source: FAQ and usage guide
id: FAQ dan panduan penggunaan

source: Daily Notifications
id: Notifikasi Harian

# dailyNotificationsSubtitle
source: Reminders to record expenses
id: Pengingat untuk mencatat pengeluaran

source: Weekly Notifications
id: Notifikasi Mingguan

# weeklyNotificationsSubtitle
source: Weekly expense summary
id: Ringkasan pengeluaran mingguan

source: Budget Notifications
id: Notifikasi Budget

# budgetNotificationsSubtitle
source: Alerts when approaching budget limit
id: Peringatan ketika mendekati batas budget

source: Close
id: Tutup

# geminiApiSetupTitle
source: Gemini API Settings
id: Pengaturan API Gemini

# geminiApiSetupDescription
source: To use our features, you need to set up Gemini API:
id: Untuk menggunakan fitur fitur kami, Anda perlu mengatur API Gemini:

# step1
source: Visit Google AI Studio
id: Kunjungi Google AI Studio

# step2
source: Create an account or log in
id: Buat akun atau login

# step2Description
source: Use your Google account
id: Gunakan akun Google Anda

# step3
source: Create a new API Key
id: Buat API Key baru

# step3Description
source: Click "Create API Key"
id: Klik "Create API Key"

# step4
source: Copy API Key
id: Salin API Key

# step4Description
source: Save securely
id: Simpan dengan aman

# step5
source: Enter into the app
id: Masukkan ke aplikasi

# step5Description
source: Paste in the API Key field
id: Paste di field API Key

source: Gemini API Key
id: API Key Gemini

source: Enter your API Key...
id: Masukkan API Key Anda...

# howToUseJournalingAi
source: ❓ How to use AI journaling?
id: ❓ Cara menggunakan journaling AI?

# howToUseJournalingAiAnswer
source: Write your expenses in natural language, AI will automatically process and categorize them
id: Tulis pengeluaran Anda dalam bahasa natural, AI akan memproses dan mengkategorikan secara otomatis

source: 🔑 How to set up Gemini API?
id: 🔑 Bagaimana cara mengatur API Gemini?

# howToSetupGeminiApiAnswer
source: Visit Google AI Studio, create an API Key, then enter it into the app settings
id: Kunjungi Google AI Studio, buat API Key, lalu masukkan ke pengaturan aplikasi

source: 📊 How to view financial reports?
id: 📊 Cara melihat laporan keuangan?

# howToViewFinancialReportsAnswer
source: Open the Reports menu to view monthly expense and category analysis
id: Buka menu Laporan untuk melihat analisis pengeluaran bulanan dan kategori

source: 🔔 How to manage notifications?
id: 🔔 Mengatur notifikasi?

# howToManageNotificationsAnswer
source: Go to Notification Settings to set daily and weekly reminders
id: Masuk ke Pengaturan Notifikasi untuk mengatur pengingat harian dan mingguan

source: 💡 App usage tips?
id: 💡 Tips menggunakan aplikasi?

# appUsageTipsAnswer
source: Record expenses regularly, use AI features for automatic categorization
id: Catat pengeluaran secara rutin, gunakan fitur AI untuk kategorisasi otomatis

source: Select Profile Photo
id: Pilih Foto Profil

source: Camera
id: Kamera

source: Gallery
id: Galeri

# logoutFromApp
source: Logout from application
id: Keluar dari aplikasi

source: Dashboard Content
id: Konten Dashboard

# categoryFoodBeverage
source: Food & Beverage
id: Makanan & Minuman

# categoryTransportation
source: Transportation
id: Transportasi

# categoryShopping
source: Shopping
id: Belanja

# categoryBills
source: Bills
id: Tagihan

# categoryEntertainment
source: Entertainment
id: Hiburan

# categoryHealth
source: Health
id: Kesehatan

# categoryEducation
source: Education
id: Pendidikan

# categoryOther
source: Other
id: Lainnya

# categoryTitle
source: Category
id: Kategori

source: Select Category
id: Pilih Kategori

source: Record Finance Now!
id: Catat Keuanganmu Sekarang Yuk!

# nominalHint
source: Example: Rp 1,000,000
id: Contoh: Rp 1.000.000

# nominalEmptyValidation
source: Nominal cannot be empty
id: Nominal tidak boleh kosong

# nominalInvalidValidation
source: Invalid nominal
id: Nominal tidak valid

# nominalEstimationHint
source: Estimated nominal is more important than detailed nominal
id: Estimasi nominal lebih penting dibanding detail rinci nominal

# dateLabel
source: Date
id: Tanggal

# dateEmptyValidation
source: Date cannot be empty
id: Tanggal tidak boleh kosong

# descriptionLabel
source: Description (Optional)
id: Deskripsi (Opsional)

# descriptionHint
source: Example: Buy lunch
id: Contoh: Beli makan siang

# manualInputTitle
source: Manual Input
id: Input Manual

# backButton
source: Back
id: Kembali

# continueButton
source: Continue
id: Lanjutkan

# selectCategorySnackbar
source: Please select a category first.
id: Pilih kategori terlebih dahulu.

# journalInputTitle
source: Journal Input
id: Input Jurnal

# journalInputHint
source: Write your expenses or income today, example: "Lunch at canteen Rp 25,000, bought a book Rp 50,000"
id: Tuliskan pengeluaran atau pemasukanmu hari ini, contoh: "Makan siang di kantin Rp 25.000, beli buku Rp 50.000"

# journalInputCardTitle
source: Write Your Financial Journal Here!
id: Tulis Jurnal Keuanganmu di sini!

# confirmButton
source: Confirm
id: Konfirmasi

# failedToParseExpense
source: Failed to parse expense: {error}
id: Gagal memproses pengeluaran: {error}

# enterJournalEntryBeforeConfirming
source: Please enter a journal entry before confirming.
id: Mohon masukkan entri jurnal sebelum mengkonfirmasi.

# recordFinanceToday
source: Record Your Finance Today!
id: Yuk ~ catat!

source: Remember it!
id: Seingat kamu ya!

source: Invalid Date Format
id: Format Tanggal Tidak Valid

source: Invalid Date
id: Tanggal Tidak Valid

# inputDetailsTitle
source: Input Details
id: Rincian Input

# dateLabelColon
source: Date:
id: Tanggal:

# amountLabelColon
source: Amount:
id: Jumlah:

# categoryLabelColon
source: Category:
id: Kategori:

# descriptionLabelColon
source: Description:
id: Deskripsi:

# paymentMethodLabelColon
source: Payment Method:
id: Metode Pembayaran:

# addMoreButton
source: Add More
id: Tambah Lagi

# originalInputLabel
source: Original Input:
id: Input Asli:

# transactionsToPdfTitle
source: Transactions to PDF
id: Transaksi ke PDF

# downloadTransactionsPdfSubtitle
source: Download Transactions as PDF
id: Unduh Transaksi menjadi PDF

source: No bill data available.
id: Tidak ada data tagihan tersedia.

# loadingTransactionsData
source: Loading transaction data...
id: Memuat data transaksi...

source: Please wait.
id: Mohon tunggu sebentar.

# offlineModeTitle
source: You are in offline mode
id: Anda sedang mode offline

# redirectingToManualInput
source: redirecting to manual recording
id: mengalihkan ke pencatatan manual

# operationSuccessfulTitle
source: Operation Successful
id: Operasi Berhasil Dilakukan

source: redirecting to home page
id: mengalihkan ke halaman utama

# underDevelopmentTitle
source: This page is under Development
id: Halaman ini sedang dalam Pengembangan

source: Expenditure {month} {year}
id: Pengeluaran {month} {year}

# monthJanuary
source: January
id: Januari

# monthFebruary
source: February
id: Februari

# monthMarch
source: March
id: Maret

# monthMay
source: May
id: Mei

# monthJune
source: June
id: Juni

# monthJuly
source: July
id: Juli

# monthAugust
source: August
id: Agustus

# monthOctober
source: October
id: Oktober

# monthDecember
source: December
id: Desember

# errorOccurred
source: An error occurred: {error}
id: Terjadi kesalahan: {error}

source: Scan Bill
id: Pindai Tagihan
